[
    {
        "id": 8853765881997788472,
        "category": "Macro",
        "title": "RT ",
        "content": "RT \n@_Investinq\n: Japan's bond market is in crisis. Investors are aggressively shorting Japanese government bonds, open interest hit 188,000 contracts, the highest since September 2024. \nBond prices fell 2.6% and yields jumped to 1.81%, the highest since 2008. The structural support that held this market together for decades is breaking down. The Bank of Japan and domestic insurance companies used to automatically buy Japanese bonds, keeping yields artificially low. Now the BoJ is reducing purchases, life insurers are net sellers and foreign investors are leaving. Meanwhile, Japan's government announced massive stimulus spending, meaning more debt issuance when fewer buyers exist.\nThis creates a vicious cycle. As yields rise, bond prices fall, creating losses for Japanese banks and insurers. When losses mount, they're forced to sell more bonds, pushing yields even higher. The government then needs to borrow more just to pay interest on existing debt. \nFor Japan's economy, higher borrowing costs directly reduce spending and hit purchasing power at the wrong time. For global markets, forced selling by Japanese institutions could create contagion across stocks, bonds, and currencies. The Bank of Japan is trapped, support the market and weaken the yen or let yields rise and risk a financial crisis. Decades of automatic buying are ending, and Japanese yields are finally pricing in real fiscal risk.\nPressure on Japanese government bonds is surging:\nOpen interest in the front month of Japan’s 10Y government bond futures just hit 188,000 contracts, the highest since September 2024.\nThe number of outstanding futures contracts that are still active has surged +65,000 since June.\nSince then, Japan’s 10Y bond futures have declined -2.6%, to 135, near the lowest since June 2008.\nDuring the same period, the 10Y government bond yield has risen +34 basis points, to 1.81%, the highest since June 2008.\nRising open interest, along with falling prices, suggests a growing accumulation of short positions among investors.\nJapan's bond market is in trouble. \n- \nThe Kobeissi Letter",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 2200521724630349805,
        "category": "Macro",
        "title": "$ORCL Deutsche Bank",
        "content": "$ORCL Deutsche Bank\nWith shares currently trading at 27x consensus CY26 EPS (which is burdened by upfront costs in scaling the AI business) there appears to be limited appetite to underwrite much more than what can be demonstrated in the here and now. While we appreciate the financial and operational risks, our view is that these are much more than offset by the very real opportunity as OpenAI backlog represents solid ROI business, continues to advance as planned, and validates Oracle's leadership in deploying AI cloud infrastructure at scale. This exercise intends to help frame the risk/reward currently embedded in shares, which we'd argue skews strongly to the upside and amidst the pullback presents an attractive entry point for investors when looking at Oracle's business in totality. We reiterate our Buy rating and DCF derived target price of $375, which implies ~38x our CY27E non-GAAP EPS",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -7355687878286921381,
        "category": "Crypto",
        "title": "RT ",
        "content": "RT \n@_Investinq\n: Bitcoin’s selling off because macro and positioning lined up badly at the same time. Japanese 2 year bond yields popping above 1% for the first time since 2008 is the market’s way of saying the Bank of Japan might actually tighten after years of ultra cheap money.  When that backdrop shifts, global risk gets repriced, volatility picks up and the fastest thing big money can hit is liquid high beta stuff like BTC. \nThis move is really about leverage getting flushed. That initial macro driven drop was enough to crack some short term support levels and trigger stops, which then started liquidating crowded long perp positions. Once exchanges are force selling hundreds of millions of dollars of leveraged longs into a thin overnight order book, you get that straight down candle, each liquidation chews through bids, gaps the book and drags the next group of margin stretched traders into the same trap.\nThe bigger point is that Bitcoin is behaving like a macro asset that’s very sensitive to interest rate expectations and global liquidity not as some isolated digital gold immune from the rest of the system. As long as the story is that yields can rise and safe assets pay more, BTC faces a headwind and trades as high beta risk.\nBREAKING: Bitcoin falls -$4,000 in 2 hours as mass liquidations return.\n$400 million worth of levered longs have been liquidated over the last 60 minutes. https://t.co/qKB7MYJapu \n- \nThe Kobeissi Letter",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -5337614467222375028,
        "category": "Macro",
        "title": "RT ",
        "content": "RT \n@cultured\n: A record breaking $188M was earned by people on Whop last month.\n> 120+ people made more than $250K\n> 300+ people made more than $100K\n> 600+ people made more than $50K\n> 2,000+ earned more than $10K\n> 35,000+ earned more than $1\n \nThere has never been a more important time for an open internet market to exist, where people can exchange ideas, software, and even physical products.\nWith support for physical products added a month ago, we’ve already created an extra $36M in annualized revenue for our merchant base.\nWe are now working hard to make it easier for more people to create quality offerings, opening up our payments and payouts infrastructure for other platforms, and expanding our affiliates + advertising products so that everyone has out of the box distribution by selling on Whop. \nNext up, we’ll be releasing new things you can do with your earned money on Whop.\nMore soon \n🚀",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -7799825769091566101,
        "category": "Macro",
        "title": "Klarna reported a 45% surge in U.S sales leading u...",
        "content": "Klarna reported a 45% surge in U.S sales leading up to Black Friday, driven by shoppers buying big ticket items like Apple AirPods 4, PS5s, and Birkenstocks. While millions of consumers wanted these premium goods, most chose to finance them rather than paying cash upfront. This massive shift confirms that Buy Now, Pay Later has become a mainstream habit, allowing people to lock in luxury items while spreading out the cost to manage their cash flow.  \nThis trend is a textbook example of the K shaped economy. In this split reality, wealthier shoppers are doing just fine, comfortably buying expensive tech and luxury goods. Meanwhile, lower and middleincome consumers are feeling the squeeze from inflation and high costs, so they are forced to rely on financing tools just to participate in the holiday season. It creates a deceptive picture, retail numbers look great because the dollar amounts are high but the underlying story is that many people are borrowing against their future just to keep up with the present.  \nThe implication is that our economy is becoming increasingly divided. Retailers are surviving because the haves are still spending and the have nots are leveraging debt to act like they are. Flexible payment options have become the bridge keeping this two tier system connected, ensuring sales volume stays high even as financial stability for many shoppers becomes more fragile. Ultimately, we are seeing a holiday season fueled as much by credit and financing as by actual disposable income.\nKLARNA REPORTS 45% BLACK FRIDAY GROWTH\nKlarna saw a 45% year-over-year increase in U.S. sales from November 1 through Black Friday. Footwear, tech, beauty, and home goods all performed strongly.\nBirkenstock led footwear, Apple AirPods 4 topped tech, PS5 models led gaming, and Baccarat Rouge 540 ranked first in beauty. Ninja products dominated home goods, with mattresses jumping to second place.\nKlarna’s data is based on online and in-app activity during Black Friday weekend. The company serves 114 million users and 850,000 retailers globally. \n- \n*Walter Bloomberg",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -8490327995938209572,
        "category": "Macro",
        "title": "RT ",
        "content": "RT \n@_Investinq\n: Japan’s 10 year government bond yield jumping to around 1.8% basically means Japan’s borrowing cost is suddenly way higher than it has been in almost two decades (save this). \nFor years, Japan lived in a world of near zero interest rates where the central bank bought a ton of government bonds and kept yields pinned down. Now inflation has picked up, the central bank is slowly stepping back and the new government is planning a big, debt funded spending package so investors are demanding more interest to keep lending to Japan’s government.\nTo Put simply, markets are starting to worry about how much Japan has borrowed and whether the government is being disciplined. When that trust weakens, bond prices fall and yields shoot up which is what the chart is showing. \nHigher yields mean, the government has to spend more just to pay interest on its huge debt, banks and insurers that hold those bonds can take mark to market hits, and borrowing costs across the economy (for mortgages, business loans, etc.) drift higher over time\nThere are knock on effects for the rest of the world too. Japan is one of the biggest players in global bond markets, and its ultra low yields have long funded carry trades into foreign assets; as Japanese yields rise, some of that money can get pulled back home which can pressure other bond markets and risk assets.\nBREAKING: Japan's 10Y Government Bond Yield surges to 1.84%, its highest level since April 2008.\nThis chart is concerning to say the least. https://t.co/fBkMMyBnqy \n- \nThe Kobeissi Letter",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -6335512123342661905,
        "category": "Macro",
        "title": "Interactive Brokers $IBKR November activity: ",
        "content": "Interactive Brokers $IBKR November activity: \nDARTs were 4.27M, up 29% YoY but 4% below October. \nClient equity came in at $770B, up 34% YoY, with 4.31M accounts (+33% YoY). \nMargin loans hit $83B (+38% YoY) and client cash/credit balances were $154B (+30% YoY).",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -3183881932802291249,
        "category": "Macro",
        "title": "BloombergNEF has bumped its US data center power f...",
        "content": "BloombergNEF has bumped its US data center power forecast by 36%. \nThey now see demand hitting about 106 GW by 2035, with AI workloads rising from roughly 12% of capacity today to close to 40%. \nFor context, 1 GW is about one nuclear unit’s output.",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -1842921501607436282,
        "category": "Politics",
        "title": "NEW: President Trump has again invited Israeli PM ...",
        "content": "NEW: President Trump has again invited Israeli PM Benjamin Netanyahu to the White House for what will be his fifth visit of Trump’s second term.",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 3764445519656029301,
        "category": "Politics",
        "title": "President Trump's meme coin has now fallen 92% fro...",
        "content": "President Trump's meme coin has now fallen 92% from its all-time high.\nStill have not seen any politicians buying it.",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -7730004833970011841,
        "category": "Macro",
        "title": "RT ",
        "content": "RT \n@bubbleboi\n: 7 Predictions for the Next 3 Years\n- Intel becomes a trillion dollar company as it takes away half of TSMC’s market cap as well as cutting out Broadcom Marvell & MediaTek as middle men\n- Nvidia loses pricing power and margins as all big tech companies come together and invest in their own ASIC stack & maybe collaborate on things like XLA & PyTorch support. \n- Google with Gemini becomes the defacto standard LLM for most applications and Google dominates the application layer (Windsurf acquisition was just a hint of that)  \n- HBM becomes much less important as models scale to hundreds of trillions of parameters. Having fast dense flash memory on boards with a small amount of DDR memory in between as a buffer becomes the right architecture hiding any bandwidth or latency issues. \n- China created a 5 nm equivalent node and makes HBM, DDR, NAND that is competitive on the global scale. \n- Taiwan gets either a blockade or an invasion leading to chips and defense stocks with mainly U.S. production spiking to the stratosphere expect Micron, Dell, & Intel Ofc to become trillion dollar companies during this brief period.\n- Bubble Boi gets a six pack and a sharp jaw line as he engages in a looksmaxxing transformation by following Clavicular’s routine.",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -5955241926179625073,
        "category": "Macro",
        "title": "Jane Street and Citadel Securities reported higher...",
        "content": "Jane Street and Citadel Securities reported higher Q3 trading revenue, with Jane Street at about record $6.83B, up 18% YoY and Citadel Securities at about record $2.64B, up 9%. \nhttps://t.co/LDCDqdnSVR",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -2387883802650724748,
        "category": "Macro",
        "title": "South Korea got its first ~13k $NVDA GPUs, includi...",
        "content": "South Korea got its first ~13k $NVDA GPUs, including B200s, as part of a plan to deploy 260k chips that analysts peg at about $10.4B. \nhttps://t.co/W8tnezuk5Z",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 6954603871612777150,
        "category": "Macro",
        "title": "Heartland Mid Cap Value Plus Fund on Brady Corp. $...",
        "content": "Heartland Mid Cap Value Plus Fund on Brady Corp. $BRC US\nThesis: Brady Corp. is a well-managed company wisely allocating capital through stock buybacks, increasing dividends, and strategic acquisitions, with strong growth potential in Aerospace and Data Centers, and a reasonable stock valuation.\n(From their Q3’25 letter — link in bio)",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 7041479684092599356,
        "category": "Macro",
        "title": "$LYFT says its new AI support system built with AW...",
        "content": "$LYFT says its new AI support system built with AWS and Anthropic is now handling driver and rider issues, cutting average resolution time by 87%, with over half of cases resolved in under 3 minutes and driver usage up ~70% in 2025. \nhttps://t.co/YfybQssswD",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 2722941628955670567,
        "category": "Macro",
        "title": "RT ",
        "content": "RT \n@wallstengine\n: SOFTBANK CEO SON: \n\"I didn’t want to sell a single share of $NVDA, but I needed the money to invest in OpenAI and other opportunities.\"\n\"When superintelligence comes, at least 10% of global GDP will be replaced by AI and AI robots.\" \nhttps://t.co/Xik3euU9xr",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": -3079037210200515662,
        "category": "Macro",
        "title": "Microsoft $MSFT CEO Satya Nadella said Monday that...",
        "content": "Microsoft $MSFT CEO Satya Nadella said Monday that his company is increasingly looking to Europe \n🇪🇺\n as a key region for its AI strategy - Politico",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 1083639490533457805,
        "category": "Macro",
        "title": "$MSFT increasingly looking to Europe as a key regi...",
        "content": "$MSFT increasingly looking to Europe as a key region for its AI strategy - Politico",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 1513467153915314287,
        "category": "Macro",
        "title": "$SNPS NVIDIA investment implies attractive risk/re...",
        "content": "$SNPS NVIDIA investment implies attractive risk/reward in SNPS stock - PT $600 Mizuho",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 6949511627471688797,
        "category": "Macro",
        "title": "U.S. Republican Senator calls for DoJ and DHS to i...",
        "content": "U.S. Republican Senator calls for DoJ and DHS to investigate Shein, $PDD's Temu for counterfeiting - Reuters \nhttps://t.co/Tc62iuMf1g",
        "sentiment": "neutral",
        "date": "2025-12-01"
    },
    {
        "id": 1,
        "category": "Macro",
        "title": "Japan's 10-Year Bond Yields Cross 1%",
        "content": "Significant move in global bond markets as Japan moves away from yield curve control. Could impact global liquidity flows.",
        "sentiment": "neutral",
        "date": "Today"
    },
    {
        "id": 2,
        "category": "Crypto",
        "title": "Bitcoin Surges Past $96k",
        "content": "Crypto markets rally on institutional adoption and ETF inflows. MicroStrategy (MSTR) continues aggressive accumulation.",
        "sentiment": "positive",
        "date": "Today"
    },
    {
        "id": 6,
        "category": "Politics",
        "title": "Trump Cabinet Picks",
        "content": "Markets reacting to potential deregulation with Trump's new cabinet appointments. Financials and Energy sectors seeing inflows.",
        "sentiment": "positive",
        "date": "Today"
    },
    {
        "id": 3,
        "category": "Economy",
        "title": "US PMI Data Shows Expansion",
        "content": "Manufacturing and Services PMI came in stronger than expected, suggesting the US economy remains resilient despite high rates.",
        "sentiment": "positive",
        "date": "Yesterday"
    },
    {
        "id": 7,
        "category": "Macro",
        "title": "DXY Strength",
        "content": "US Dollar Index strengthening as other central banks cut rates faster than the Fed, putting pressure on emerging markets.",
        "sentiment": "neutral",
        "date": "Yesterday"
    },
    {
        "id": 4,
        "category": "Politics",
        "title": "Fed Chair Powell Signals Caution",
        "content": "Federal Reserve emphasizes data dependence, dampening hopes for immediate aggressive rate cuts.",
        "sentiment": "negative",
        "date": "Yesterday"
    },
    {
        "id": 8,
        "category": "Crypto",
        "title": "Solana ETF Hopes",
        "content": "Speculation mounts over a potential Solana ETF approval following Ethereum's lead, driving altcoin momentum.",
        "sentiment": "positive",
        "date": "2 days ago"
    },
    {
        "id": 5,
        "category": "Commodities",
        "title": "Silver Prices Breakout",
        "content": "Industrial demand and safe-haven buying pushing silver to multi-year highs.",
        "sentiment": "positive",
        "date": "2 days ago"
    }
]